$(document).ready(function () {
    // Массив с названиями групп
    const groups = [
        "ИС-112/24",
        "ИСк-114/24",
        "ТО-115/24",
        "МЭ-117/23",
        "МР-15/22",
        "МР-16/24",
        "СВ-11/24",
        "ИС-212/23",
        "ИС-214/23",
        "ТО-215/23",
        "МЭ-217/23",
        "МЭ-219/23",
        "МР-25/23",
        "СВ-21/23",
        "ИС-312/22",
        "ИС-314/22",
        "ТО-315/22",
        "МЭ-317/22",
        "МЭ-319/22",
        "МР-35/22",
        "СВ-31/22",
        "ИС-412/21",
        "ИС-414/21",
        "ТО-413/21",
        "ТО-415/21",
        "МЭ-417/21"
    ];

    // Генерация опций для выпадающего списка
    const groupSelect = $('#groupSelect');
    groupSelect.append('<option value="">Выберите группу</option>');
    groups.forEach(group => {
        groupSelect.append(`<option value="${group}">${group}</option>`);
    });
});